{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 15, 2606], "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "units": 512, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activation": "tanh", "trainable": true, "stateful": false, "kernel_regularizer": null, "name": "lstm_1", "bias_constraint": null, "implementation": 0, "use_bias": true, "return_sequences": true, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "units": 512, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activation": "tanh", "trainable": true, "recurrent_regularizer": null, "kernel_regularizer": null, "name": "lstm_2", "bias_constraint": null, "implementation": 0, "use_bias": true, "return_sequences": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "units": 2606, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}