{"keras_version": "2.0.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dtype": "float32", "stateful": false, "activation": "tanh", "use_bias": true, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "return_sequences": true, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 512, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "batch_input_shape": [null, 20, 58], "trainable": true, "name": "lstm_1", "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "stateful": false, "trainable": true, "activation": "tanh", "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "return_sequences": false, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 512, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "unit_forget_bias": true, "dropout": 0.0, "name": "lstm_2", "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 58, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}