{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "units": 512, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "use_bias": true, "batch_input_shape": [null, 15, 2845], "recurrent_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "stateful": false, "go_backwards": false, "return_sequences": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "implementation": 0, "kernel_regularizer": null, "units": 512, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "use_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "stateful": false, "go_backwards": false, "return_sequences": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "units": 2845, "name": "dense_1", "kernel_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}