{"config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 20, 58], "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "use_bias": true, "implementation": 0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "units": 512, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "dropout": 0.0, "activation": "tanh", "name": "lstm_1", "trainable": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "use_bias": true, "implementation": 0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "units": 512, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "dropout": 0.0, "activity_regularizer": null, "name": "lstm_2", "trainable": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 58, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.3", "class_name": "Sequential"}