{"backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "dropout": 0.0, "implementation": 0, "stateful": false, "go_backwards": false, "trainable": true, "activity_regularizer": null, "dtype": "float32", "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 15, 4027], "recurrent_constraint": null, "kernel_regularizer": null, "return_sequences": true, "units": 512, "name": "lstm_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "dropout": 0.0, "implementation": 0, "stateful": false, "activation": "tanh", "trainable": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "return_sequences": false, "units": 512, "name": "lstm_2"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 4027, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "class_name": "Sequential", "keras_version": "2.0.3"}