{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "lstm_1", "implementation": 0, "dtype": "float32", "go_backwards": false, "stateful": false, "recurrent_constraint": null, "batch_input_shape": [null, 10, 2604], "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "return_sequences": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "lstm_2", "implementation": 0, "go_backwards": false, "stateful": false, "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "activation": "linear", "kernel_regularizer": null, "units": 2604, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.0.3"}