{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "lstm_1", "return_sequences": true, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "batch_input_shape": [null, 10, 4289], "go_backwards": false, "dropout": 0.0, "units": 512, "dtype": "float32", "recurrent_constraint": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "lstm_2", "return_sequences": false, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "unit_forget_bias": true, "bias_constraint": null, "go_backwards": false, "dropout": 0.0, "units": 512, "recurrent_constraint": null, "kernel_regularizer": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 4289, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}